//算術演算子
//計算を行う記号です

console.log(10 + 3);  // 13
console.log(10 - 3);  // 7
console.log(10 * 3);  // 30
console.log(10 / 2);  // 5
console.log(10 % 3);  // 1

///少数の計算における四捨五入
console.log(0.1 + 0.2) //0.30000000000000004
console.log(Math.round((0.1 + 0.2) *10) / 10);//0.3

//文字にも算術演算子がつかえます。文字につかれる演算子は「＋」のみ

console.log("こんにち" + "は"); //こんにちは 文字列の結合を行います

//「+」を数値型の数値と文字列型の数値と合わせると結合されます。
console.log("10" + 10); //1010
console.log(10 + "10"); //1010

console.log(10 + 10);//20

//その他の演算子は数値型の数値と文字列型の数値は計算できます

console.log("10" - 2);//8

console.log("abc" - 2);// NaN